src/cf/Catalogs/кт_ЗначенияПоказателейВыручки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>кт_ЗначенияПоказателейВыручки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыеПоказатели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначениеПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/кт_ЗначенияПоказателейВыручки/Ext/ObjectModule.bsl
//Кт Начало Апаев_О [10.08.2022]
Процедура ПередЗаписью(Отказ)
	
	Год = НачалоГода(Год);
	
	ПроверитьНаличиеПоказателей(Год);
	
	Если ЗначениеЗаполнено(Год) И ЗначениеПоказателей.Количество() = 12 Тогда
		
		Для Каждого Строка Из ЗначениеПоказателей Цикл
			
			НомерМесяца = Строка.НомерСтроки; 
			Месяц 	    = Строка(НомерМесяца);
			
			Если СтрДлина(Месяц) = 1 Тогда
				Месяц = "0" + Месяц;
			КонецЕсли;
			
			Строка.Период = Дата(Формат(Год, "ДФ=yyyy") + Месяц + "01");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПоказателей(Год)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	кт_ЗначенияПоказателейВыручки.Ссылка КАК Показатель
	|ИЗ
	|	Справочник.кт_ЗначенияПоказателейВыручки КАК кт_ЗначенияПоказателейВыручки
	|ГДЕ
	|	кт_ЗначенияПоказателейВыручки.Год = &Год
	|	И кт_ЗначенияПоказателейВыручки.ПлановыеПоказатели = &ПлановыеПоказатели
	|	И НЕ кт_ЗначенияПоказателейВыручки.Ссылка = &Показатель
	|
	|СГРУППИРОВАТЬ ПО
	|	кт_ЗначенияПоказателейВыручки.Ссылка";
	
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("ПлановыеПоказатели", ПлановыеПоказатели);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.УстановитьПараметр("Показатель", Ссылка);	
	Иначе
		Запрос.УстановитьПараметр("Показатель", Справочники.кт_ЗначенияПоказателейВыручки.ПустаяСсылка());
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Если ПлановыеПоказатели = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В системе уже указаны плановые показатели за " + Формат(Год, "ДФ=yyyy") + " год!");	
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В системе уже указаны показатели за " + Формат(Год, "ДФ=yyyy") + " год!");
		КонецЕсли;
		
		Отказ = Истина;	
		
	КонецЕсли;
	
КонецПроцедуры
//Кт Окончание Апаев_О [10.08.2022]
